% Ex_7_16.m
% 使用 bar 函数与 barh 函数绘图示例
% 条形图 示例bar竖直条形图 barh水平条形图
Y = round(rand(5,3)*10);    % 随机产生一个5X3矩阵,每个元素为1-10之间的整数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
subplot(2,2,1)              % 设定绘图区域,在图形对象的左上角绘制
bar(Y,'group')
title 'Group'
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
subplot(2,2,2)
bar(Y,'stack')
title 'Stack'
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
subplot (2,2,3)
barh(Y,'stack')             % 绘制横向条形图
title 'Stack'
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
subplot(2,2,4)
bar(Y,7.5)
title 'Width = 7.5'
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%