% myfun4.m
%{
某工程因生产需要欲采购一种原材料，市场中这种原材料有2个等级，
甲级单位2元/千克，乙级单位1元/千克.
要求所花总费用不超过200元，购得原材料总量不少于100千克，
其中甲级原材料尽量多。
设X1,X2分别为采购甲级和乙级原材料的数量（千克），要求总采购费尽量少，
总采购重量尽量多，采购甲级原材料尽量多
%}
function f = myfun4(x)
f(1) = 2*x(1)+x(2);
f(2) = -x(1)+x(2);
f(3) = -x(1);
%{
goal = [200 -100 -50];
weight = [2040 -100 -50];
x0 = [55 55];
A = [2 1;-1 -1;-1 0];
b = [200 -100 -50];
x0 = [55 55];
A = [2 1;-1 -1;-1 0];
b = [200 -100 -50];
lb = zeros(2,1);
[x,fval,attainfactor,exitflag] = fgoalattain(@myfun4,x0,goal,weight,A,b,[],[],lb,[])
x =
    50    55
fval =
   155     5   -50
attainfactor =
   5.7441e-11

exitflag =
     4
%}